{"LEGISL": "Does the constitution provide for a central representative body (a legislature)?", "AMEND": "Does the constitution provide for at least one procedure for amending the constitution?", "CABINET": "Does the constitution mention the executive cabinet/ministers?", "EQUAL": "Does the constitution refer to equality before the law, the equal rights of men, or non-discrimination?", "ASSEM": "Does the constitution provide for freedom of assembly?", "EXPRESS": "Does the constitution provide for freedom of expression or speech?", "ASSOC": "Does the constitution provide for freedom of association?", "EDUCATE": "Does the constitution contain provisions concerning education?", "FREEREL": "Does the constitution provide for freedom of religion?", "MILITARY": "Is the military or armed forces mentioned in the constitution?", "EXPROP": "Can the government expropriate private property under at least some conditions?", "TREAT": "Does the constitution mention international treaties?", "INTLAW": "Does the constitution contain provisions concerning the relationship between the constitution and international law?", "DEMOC": "Does the constitution refer to \"democracy\" or \"democratic\"?", "EM": "Does the constitution refer to \"democracy\" or \"democratic\"?", "VOTERES": "Does the constitution place any restrictions on the right to vote?", "FREEMOVE": "Does the constitution provide for freedom of movement?", "PROPRGHT": "Does the constitution provide for a right to own property?", "OATH": "Does the constitution stipulate that some public office holders take an oath to support or abide by the constitution?", "PRIVACY": "Does the constitution provide for a right of privacy?", "PART": "Does the constitution refer to political parties?", "OPINION": "Does the constitution provide for freedom of opinion, thought, and/or conscience?", "EXPOST": "Does the constitution prohibit punishment by laws enacted ex post facto ?", "HOSDISS": "Are there provisions for dismissing the Head of State?", "JUDIND": "Does the constitution contain an explicit declaration regarding the independence of the central judicial organ(s)?", "CRUELTY": "Does the constitution prohibit cruel, inhuman, or degrading treatment?", "FREEELEC": "Does the constitution prescribe that electoral ballots be secret?", "HABCORP": "Does the constitution provide for the right to protection from unjustified restraint (habeas corpus)?", "TORTURE": "Does the constitution prohibit torture?", "LIFE": "Does the constitution provide for a right to life?", "ENV": "Does the constitution refer to protection or preservation of the environment?", "COUNS": "Does the constitution provide the right to counsel if one is indicted or arrested?", "JOINTRDE": "Does the constitution provide for the right to form or to join trade unions?", "PRESINOC": "Is there a presumption of innocence in trials?", "DIGNITY": "Does the constitution refer to the \"dignity of man\" or human \"dignity\"?", "REFEREN": "Does the constitution stipulate that some public office holders take an oath to support or abide by the constitution?", "AMNDAMAJ": "Do constitutional amendments require more than a simple majority by the legislature to be approved?", "EXINST": "Does the constitution contain provisions with regard to any additional central independent regulatory agencies ?", "JC": "Does the constitution contain provisions for a Judicial Council/Commission?", "JREM": "Are there provisions for dismissing judges?", "REMLEG": "Are there provisions for removing individual legislators?", "WOLAW": "Does the constitution mention nulla poena sine lege or the principle that no person should be punished without law?", "INTORGS": "Does the constitution contain provisions concerning international organizations?", "PUBTRI": "Does the constitution generally require public trials?", "FLAG": "Does the constitution contain provisions concerning the national flag?", "INALRGHT": "Does the constitution stipulate that certain rights are inalienable or inviolable?", "PRESS": "Does the constitution provide for freedom of expression or speech?", "EDFREE": "Does the constitution stipulate that education be free, at least up to some level?", "CULTRGHT": "Does the constitution refer to a state duty to protect or promote culture or cultural rights?", "VOTEUN": "Does the constitution make a claim to universal adult suffrage?", "EDCOMP": "Does the constitution stipulate that education be compulsory until at least some level?", "PETITION": "Does the constitution provide for a right of petition?", "SCIENCE": "Does the constitution refer to artists or the arts?", "EMRIGHTS": "Does the constitution provide for suspension or restriction of rights during states of emergency?", "EVIDENCE": "Does the constitution regulate the collection of evidence?", "NATCIT": "Does the constitution provide for naturalized citizens or naturalization?", "GOD": "Does the constitution mention \"God\" or any other Deities?", "ANTHEM": "Does the constitution contain provisions concerning the national anthem?", "RESRCE": "Does the constitution refer to ownership or possession of natural resources (such as minerals, oil, etc.)?", "ARTISTS": "Does the constitution refer to artists or the arts?", "PARTRGHT": "Does the constitution provide for a right to form political parties?", "OCCUPATE": "Does the constitution provide for the right to choose ones occupation?", "PUBMEET": "Does the constitution prescribe whether or not the meetings of the Legislature are (generally) held in public?", "CAPITAL": "Does the constitution contain provisions specifying the location of the capital (if so, please specify the location in the comments section)?", "MILSERV": "Does the constitution refer to a duty of military service?", "HEALTHR": "Does the constitution mention the right to health care?", "MIRANDA": "Does the constitution give the accused a right to silence or protection from self incrimination?", "FINSUP_4": null, "DOUBJEP": "Does the constitution provide for the prohibition of double jeopardy (i.e., being tried for the same crime twice)?", "FORTRAD": "Does the constitution mention foreign or international trade?", "SOCSEC": "Does the constitution refer to the social security of the society or nation?", "FAIRTRI": "Does the constitution provide the right to a fair trial?", "RULELAW": "Does the constitution contain a general statement regarding rule of law, legality, or Rechtsstaat (the German equivalent)?", "STRIKE": "Does the constitution provide for a right to strike?", "REMUNER": "Does the constitution provide the right to just remuneration, fair or equal payment for work?", "EXPRCOMP": "What is the specified level of compensation for expropriation of private property?", "PROVHLTH": "Does the constitution mention a state duty to provide health care?", "LANGPROT": "Does the constitution refer to the protection of different languages?", "LANG": "In what language is the source document written (not the original, but the one used for coding)?", "ASYLUM": "Does the constitution contain provisions for the protection of stateless individuals, refugees from other states, or the right to asylum?", "HOSID": "Is one of the executives explicitly referred to as the \"Head of State\"?", "SPEEDTRI": "Does the constitution provide for the right to a speedy trial?", "CENSOR": "Does the constitution prohibit censorship?", "LHCOHORT": "Are members of the first (or only) chamber elected in the same cohort, or in staggered cohorts?", "SOLID": "Does the constitution refer to \"fraternity\" or \"solidarity\"?", "TELECOM": "Is there a mention of telecommunications?", "TAXES": "Does the constitution refer to a duty to pay taxes?", "INVEXE": "Does the legislature have the power to investigate the activities of the executive branch?", "LEISURE": "Does the constitution provide for a right of rest and leisure?", "OVERSGHT": "Does the constitution provide for an electoral commission or electoral court to oversee the election process?", "UNAMEND": "Are any parts of the constitution unamendable?", "BANK": "Does the constitution contain provisions for a central bank?", "SLAVE": "Does the constitution prohibit slavery, servitude, or forced labor?", "CHILDPRO": "Does the constitution guarantee the rights of children?", "JUDSAL": "Does the constitution explicitly state that judicial salaries are protected from governmental intervention?", "DUEPROC": "Does the constitution explicitly mention due process?", "JURY": "Does the constitution require a jury or any form of citizen participation in decision making in criminal trials?", "CENSUS": "Does the constitution specify a census?", "PREREL": "Does the constitution provide for the right/possibility of pre-trial release?", "TV": "Does the constitution refer to television?", "SAFEWORK": "Does the constitution mention the right to safe/healthy working conditions?", "TRILANG": "Does the constitution specify the trial has to be in a language the accused understands or the right to an interpreter if the accused cannot understand the language?", "ILLADMIN": "Does the constitution contain provisions protecting the individual against illegal or ultra-vires administrative actions?", "INFOACC": "Does the constitution provide for an individual right to view government files or documents under at least some conditions?", "BUSINES": "Does the constitution provide a right to conduct/establish a business?", "FALSEIMP": "Does the constitution provide for the right of some redress in the case of false imprisonment, arrest, or judicial error?", "OMBUDS": "Does the constitution provide for an Ombudsman?", "INTEXEC": "Does the legislature have the power to interpellate members of the executive branch??", "ACFREE": "Does the constitution guarantee academic freedom?", "OFFREL": "Does the constitution contain provisions concerning a national or official religion or a national or official church?", "RADIO": "Does the constitution refer to radio?", "CHILDWRK": "Does the constitution place limits on child employment?", "RGHTAPP": "Do defendants have the right to appeal judicial decisions?", "LIBEL": "Does the constitution provide for the right of protection of one's reputation from libelous actions?", "INHERIT": "Does the constitution provide for inheritance rights?", "CUSTLAW": "Does the constitution refer to \"customary\" international law or the \"law of nations\"?", "FNDFAM": "Does the constitution provide the right to found a family?", "MATEQUAL": "Does the constitution provide for matrimonial equality?", "WORK": "Does the constitution mention a state duty to provide work/employment?", "SEPREL": "Does the constitution contain an explicit decree of separation of church and state?", "FEDREV": "Does the constitution contain provisions allowing review of the legislation of the constituent units in federations by federal judicial or other central government organs?", "SHELTER": "Does the constitution provide for the right to shelter or housing?", "CITREN": "Do citizens have the right to renounce their citizenship?", "TRANSFER": "Does the constitution mention the right to transfer property freely?", "SOCECON": "Does the constitution use the words (socio-) economic rights or similar?", "BUILDSOC": "Does the constitution refer to a duty of the people to take part in building society or to work for the development of the country?", "PREVCOND": "Does the constitution refer to social, political, or economic conditions in the time before the birth of the state or in the time of a former constitution?", "LEGSUPR": "Is a supermajority needed for passing any legislation?", "STANDLIV": "Does the constitution provide for a right to an adequate or reasonable standard of living?", "CONRIGHT": "Does the constitution mention consumer rights or consumer protection?", "HEALTHF": "Does the constitution specify that healthcare should be provided by government free of charge?", "ETHINCL": "Does the constitution contain provisions concerning national integration of ethnic communities?", "ECONPLAN": "Does the constitution mention the adoption of national economic plans?", "NOMIL": "Is there a right to exemption from military service for conscientous objectors to war or other groups?", "INITIAT": "Does the constitution provide for the ability of individuals to propose legislative initiatives (referenda from below)?", "MOTTO": "Does the constitution contain a national motto?", "FREECOMP": "Does the constitution provide the right to a free and/or competitive market?", "HOGID": "Is one of the executives explicitly referred to as the \"Head of Government\"?", "TERR": "Does the constitution define the geographic borders/territory of the state?", "ACCESS": "Are there provisions for the secession or withdrawal of parts of the state?", "EXECINDP": "Does the constitution contain an explicit declaration regarding the INDEPENDENCE of the central executive organ(s)?", "ARMS": "Does the constitution provide for the right to bear arms?", "BINDING": "Are rights provisions binding on private parties as well as the state?", "BANKRUPT": "Does the constitution mention bankruptcy law?", "DEVLPERS": "Does the constitution provide for an individual's right to self determination or the right to free development of personality?", "PROVWORK": "Does the constitution mention a state duty to provide work/employment?", "MEDCOM": "Does the constitution mention a special regulatory body/institution to oversee the media market?", "HR": "Does the constitution suggest that citizens should have the right to overthrow their government under certain circumstances?", "SOCIALSM": "Does the constitution refer to \"socialism\" or \"socialist\"?", "MARKET": "Does the constitution refer to the \"free market,\" \"capitalism,\" or an analogous term?", "CONREM": "Does the constitution mention any special procedures for removing members of the constitutional court?", "LHQUOTA": "Does the constitution stipulate a quota for representation of certain groups in the first (or only) chamber?", "HOSHOG": "Is the executive identified explicitly as the Head of State or Head of Government?", "UHELSYS": "Does the constitution specify the electoral system for the Second Chamber?", "CIVIL": "Does the constitution include provisions for the meritocratic recruitment of civil servants (e.g. exams or credential requirements)?", "JUVENILE": "Does the constitution give juveniles special rights/status in the criminal justice process?", "SELFDET": "Does the constitution provide for a people's right of self-determination?", "EXCRIM": "Does the constitution provide for the extradition of suspected or convicted criminals to other countries?", "DEBTORS": "Does the constitution forbid the detention of debtors?", "OPGROUP": "Does the constitution provide for positive obligations to transfer wealth to, or provide opportunity for, particular groups?", "COMPVOTE": "Does the constitution make voting mandatory, at least for some elections?", "JUDPREC": "Does the constitution stipulate that courts have to take into account decisions of higher courts?", "FEDUNIT": "Is the state described as either federal, confederal, or unitary?", "CITDEP": "Does the constitution grant the government the right to deport citizens or residents?", "EQUALGR_16": null, "HOCOP": "Does the constitution provide for judicial opinions of the Highest Ordinary Court?", "TESTATE": "Does the constitution provide for a right of testate, or the right to transfer property freely after death?", "TERROR": "Is there special mention of terrorism and public security provisions regarding terrorism?", "SCIFREE": "Does the constitution provide for a right to enjoy the benefits of scientific progress?", "ASSETS": "Does the constitution require that legislators disclose their earnings and/or assets?", "EQUALGR_8": null, "ACHIGHED": "Does the constitution guarantee equal access to higher education?", "UHQUOTA": "Does the constitution stipulate a quota for representation of certain groups in the Second Chamber?", "CC": null, "AMPARO": "Does the constitution provide for a right to petition for \"amparo\"?", "JUDRETIR": "Is there a mandatory retirement age for judges?", "CONCOP": "Does the constitution mention judicial opinions of the Constitutional Court?", "FORINVES": "Does the constitution mention \"foreign investment\" or \"foreign capital\"?", "OVERTHRW": "Does the constitution suggest that citizens should have the right to overthrow their government under certain circumstances?", "MARRIAGE": "Does the constitution provide for the right to marry?", "IMMUNITY": "Does the constitution provide for immunity for the members of the Legislature under some conditions?", "WARAP": "Who has the power to approve declarations of war?", "PRISONRG": "Does the constitution require that the names of those imprisoned be entered in a public registry?", "LEGJOINT": "Does the constitution specify that the chambers should meet jointly for any reason?", "PROFLEG": "Does the constitution require that legislators give up any other profession (i.e. work exclusively as legislators)?", "EXAMWIT": "Does the constitution provide for the right to examine evidence or confront all witnesses?", "NAT": "Does the constitution contain provisions concerning the relationship between the constitution and international law?", "SECCESS": "Are there provisions for the secession or withdrawal of parts of the state?", "GOVMED": "How does the constitution address the state operation of print or electronic media?", "TRUTHCOM": "Does the constitution provide for a commission for truth and reconciliation?", "RESENEX": "Does the constitution restrict entry or exit of the states borders?", "PARTPRH": "Does the constitution prohibit one or more political parties?", "PARTPRF": "Does the constitution express a preference for one or more political parties?", "PREVLEAD": "Does the constitution mention anything about crimes committed by the previous regime?", "HOUSENUM": "How many chambers or houses does the Legislature contain?", "PRTYDUTY": "Does the constitution refer to a duty to join a political party?", "TRADEUN": "Does the constitution refer to a duty to join trade unions?"}